#Feature: Login feature
#  Отговаря за вход в системата на предварително регистриран потребител
#
#  Scenario: Вход в системата с валидни данни
#    Given потребителя отваря началната страница
#    And натиска върху бутона за вход в ситемата
#    And визуализира се форма за вход в системата
#    When въведе вадно потребителско име
#    And веведе валидна парола
#    And натисне бутона за вход
#    Then вижда съобщение с текст "Браво!!!!"
#
##  Scenario: Вход в системата с грешна парола
##    Given потребителя отваря началната страница
##    And натиска върху бутона за вход в ситемата
##    And визуализира се форма за вход в системата
##    When въведе вадно потребителско име
##    And веведе грешна парола
##
##    And натисне бутона за вход
##    Then вижда съобщение с текст "Грешни данни!"
